freedom <- c("自由", "言论自由", "集会自由", "新闻自由", "结社自由", "自由权", "民主自由", "自由言论", "创作自由", 
  "婚姻自主", "自由民主", "自由市场", "自决", "自决权", "生而自由", "自由自在", "自由选择", "自由思想", "公民自由", 
  "自由竞争", "宗教自由", "自由价格")

democracy <- c("民主", "自由民主", "民主自由", "民主制度", "民主化", "社会民主主义", "民主运动", "民主主义", 
  "民主改革", "民主制", "民主选举", "民主权力", "多党制", "民主法制", "民主权利")

election <- c("选举", "直接选举", "议会选举", "间接选举", "直选", "换届选举", "民选", "投票选举", "全民公决", "总统大选", 
  "大选", "普选", "全民投票", "民主选举")

collective.action <- c("抗议", "示威", "示威游行", "示威抗议", "游行示威", "静坐示威", "绝食抗议", "请愿", "示威运动", 
  "游行", "罢教", "静坐", "集会游行", "罢课", "签名运动")

negative.figure <- c("林彪", "王洪文", "张春桥", "江青", "姚文元", "刘晓波", "丹增嘉措", "李洪志", "陈水扁", "黄之锋", "黎智英",
                    "艾未未", "李登辉", "李柱铭", "何俊仁", "陈方安生", "达赖", "陈光诚", "滕彪", "魏京生", "鲍彤")

social.control <- c("维稳", "处突", "社会治安", "反恐怖", "公安工作", "预防犯罪", "收容审查", "治安工作", "大排查", 
  "扫黄打非", "接访", "反邪教")

surveillance <- c("监控", "监测", "监视", "管控", "监看", "监视系统", "截听", "监控中心", "情报服务", "排查", "监视器",
 "情报搜集", "间谍卫星", "管理网络", "监控器", "监控站", "监控室", "数据采集")

party <- c("党中央",  "中国共产党", "党支部", "中共中央", "共青团", "共青团中央", "党委", "中央党校")

history <- c("抗日战争", "解放战争", "抗美援朝", "改革开放", "香港回归", "长征", "三大战役", "秋收起义", "南昌起义","澳门回归",
             "志愿军", "土地改革", "六四", "遵义会议", "九二南巡", "广州起义", "西藏和平解放", "井冈山会师", "百团大战",
             "文革", "文化大革命", "大跃进", "四人帮", "解放农奴")        

positive.figure <- c("毛泽东", "江泽民", "胡锦涛", "习近平", "周恩来", "朱镕基", "温家宝", "李克强", "邓小平",
                     "曾庆红", "华国锋", "李鹏", "杨尚昆", "谷牧", "吴邦国", "李岚清", "纪登奎", "乔石","邹家华", 
                     "李瑞环", "俞正声", "张高丽", "田纪云", "回良玉", "李源潮", "贾庆林", "姚依林", "张立昌", 
                     "尉健行", "姜春云", "李铁映", "王兆国", "罗干", "刘靖基", "杨汝岱", "王光英", "彭佩云", 
                     "刘云山", "丁关根", "彭真", "胡启立", "曾培炎", "何东昌")    

pos.subst <- c("稳定", "繁荣", "富强", "平稳", "幸福", "振兴", "发展", "兴旺", "国泰民安", 
               "昌盛", "强盛", "稳当", "安定", "局势稳定", "安定团结", "长治久安", "安居乐业")

neg.subst <- c("动荡", "衰落", "震荡", "贫瘠", "不幸",  "衰退", "萧条", "败落", "国破家亡", 
               "没落", "衰败", "摇摆", "不稳", "时局动荡", "颠沛流离", "动荡不安", "民不聊生")